#!/bin/bash
#-------------------------------------------------------------#
#-------------------------------------------------------------#
#𝗦𝗰𝗿𝗶𝗽𝘁 𝗪𝗿𝗶𝘁𝗲𝗿 : 𝗟𝗶𝗺𝗼𝗻 𝗛𝗼𝘀𝘀𝗮𝗶𝗻
#𝗖𝗿𝗲𝗱𝗶𝘁 : 𝗗𝗔𝗥𝗞_𝗧𝗘𝗔𝗠_𝗟𝗠𝗡𝘅𝟵
#𝗚𝗶𝘁𝗛𝘂𝗯 : 𝗟𝗠𝗡𝘅𝟵-𝗝𝗢𝗛𝗡𝗬
#𝗙𝗮𝗰𝗲𝗯𝗼𝗼𝗸 : 𝗟𝗝.𝗟𝗠𝗡𝘅𝟵
#𝗧𝗼𝗼𝗹 : 𝗗𝗶𝗿𝗲𝗰𝘁 𝗪𝗔 𝗦𝗠𝗦
#𝗩𝗲𝗿𝘀𝗶𝗼𝗻 : 𝟭.𝟬.𝟭𝘅
#-------------------------------------------------------------#
#-------------------------------------------------------------#
#𝗕𝗹𝗮𝗰𝗸   \e[30m
#𝗥𝗲𝗱     \e[31m
#𝗚𝗿𝗲𝗲𝗻   \e[32m
#𝗕𝗹𝘂𝗲    \e[33m
#𝗬𝗲𝗹𝗹𝗼𝘄  \e[34m
#𝗣𝗶𝗻𝗸    \e[35m
#𝗦𝗸𝘆     \e[36m
#𝗪𝗵𝗶𝘁𝗲   \e[37m
#-------------------------------------------------------------#
#-------------------------------------------------------------#
clear
echo ""
echo -e "\e[36m\a\a
\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■
\e[36m  ██      ███    ███ ███    ██ ██   ██  █████  
\e[35m  ██      ████  ████ ████   ██  ██ ██  ██   ██ 
\e[36m  ██      ██ ████ ██ ██ ██  ██   ███    ██████ 
\e[35m  ██      ██  ██  ██ ██  ██ ██  ██ ██       ██ 
\e[36m  ███████ ██      ██ ██   ████ ██   ██  █████ 
\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■
"
echo -e "\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■"
echo -e "\e[32m  ■━━━➤ 𝗧𝗼𝗼𝗹 ➤ 𝗗𝗶𝗿𝗲𝗰𝘁 𝗪𝗵𝗮𝘁𝘀𝗮𝗽𝗽 𝗦𝗠𝗦"
echo -e "\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■"
echo -e "\e[31m   ■━━━➤ 𝗗𝗔𝗥𝗞 ➤ 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟵"
echo -e "\e[32m   ■━━━➤ 𝗔𝘂𝘁𝗵𝗼𝗿 ➤ 𝗝𝗢𝗛𝗡𝗬"
echo -e "\e[34m   ■━━━➤ 𝗚𝗶𝘁𝗛𝘂𝗯 ➤ 𝗟𝗠𝗡𝘅𝟵-𝗝𝗢𝗛𝗡𝗬"
echo -e "\e[36m   ■━━━➤ 𝗧𝗲𝗹𝗲𝗴𝗿𝗮𝗺 ➤ 𝗗𝗔𝗥𝗞_𝗟𝗠𝗡𝘅𝟵"
echo -e "\e[33m   ■━━━➤ 𝗙𝗮𝗰𝗲𝗯𝗼𝗼𝗸 ➤ 𝗟𝗝.𝗟𝗠𝗡𝘅𝟵"
echo -e "\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■"
echo -e " \e[32m"
read -p " ■━━━➤ 𝗘𝗻𝘁𝗲𝗿 𝗖𝗼𝘂𝗻𝘁𝗿𝘆 𝗖𝗼𝗱𝗲 ➤ " code
echo -e " \e[32m"
read -p " ■━━━➤ 𝗘𝗻𝘁𝗲𝗿 𝗪𝗔 𝗡𝘂𝗺𝗯𝗲𝗿 ➤ " number
echo -e " \e[37m"
read -p " ■━━━➤ 𝗘𝗻𝘁𝗲𝗿 𝗠𝗲𝘀𝘀𝗮𝗴𝗲 ➤ " message
echo -e " \e[33m"
read -p " ■━━━➤ 𝗣𝗿𝗲𝘀𝘀 𝗘𝗻𝘁𝗲𝗿 𝗧𝗼 𝗖𝗼𝗻𝘁𝗶𝗻𝘂𝗲 ➤" press
sleep 1
echo " "
clear
echo ""
echo ""
echo -e "\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■"
echo -e "\e[32m  ■━━━➤ 𝗧𝗼𝗼𝗹 ➤ 𝗗𝗶𝗿𝗲𝗰𝘁 𝗪𝗵𝗮𝘁𝘀𝗮𝗽𝗽 𝗦𝗠𝗦"
echo -e "\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■"
echo -e "\e[31m   ■━━━➤ 𝗗𝗔𝗥𝗞 ➤ 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟵"
echo -e "\e[32m   ■━━━➤ 𝗔𝘂𝘁𝗵𝗼𝗿 ➤ 𝗝𝗢𝗛𝗡𝗬"
echo -e "\e[34m   ■━━━➤ 𝗚𝗶𝘁𝗛𝘂𝗯 ➤ 𝗟𝗠𝗡𝘅𝟵-𝗝𝗢𝗛𝗡𝗬"
echo -e "\e[36m   ■━━━➤ 𝗧𝗲𝗹𝗲𝗴𝗿𝗮𝗺 ➤ 𝗗𝗔𝗥𝗞_𝗟𝗠𝗡𝘅𝟵"
echo -e "\e[33m   ■━━━➤ 𝗙𝗮𝗰𝗲𝗯𝗼𝗼𝗸 ➤ 𝗟𝗝.𝗟𝗠𝗡𝘅𝟵"
echo -e "\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■"
echo " "
echo -e "\e[36m   ■━━━➤ 𝗣𝗹𝗲𝗮𝘀𝗲 𝗪𝗮𝗶𝘁...."
echo -e "\e[36m   ■━━━➤ 𝗟𝗼𝗮𝗱𝗶𝗻𝗴...."
sleep 3
xdg-open https://wa.me/$code$number/?text=$message
sleep 2
clear
echo ""
echo ""
echo -e "\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■"
echo -e "\e[36m   █▀█ █▀█ █▀█ █▀▀ █▀▀ █▀▀ █▀ █▀"
echo -e "\e[36m   █▀▀ █▀▄ █▄█ █▄▄ █▄▄ ██▄ ▄█ ▄█"
echo -e "\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■"
echo -e "\e[36m      █▀▄ █▀█ █▄░█ █▀▀ 𝗟𝗠𝗡𝘅𝟵"
echo -e "\e[36m      █▄▀ █▄█ █░▀█ ██▄ 𝘃𝟭.𝟬.𝟭"
echo -e "\e[35m■━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━■"
echo ""
echo ""
