#tools by RIMON_AHMED---TERMUX-COURSE
import random
import time
import os
#______________________________# 
###_________UA--MAIN___________###
#______________________________# 

def DARK_LMNx9():
    user_agents = []
    user_agent = fl[FBAN/FB4A;FBAV/"+str(random.randint(199,399))+".0.0."+str(random.randint(1,9))+"."+str(random.randint(99,199))+";FBBV/"+str(random.randint(111111111,999999999))+";FBDM/{density="+str(random.randint(2,3))+"."+str(random.randint(2,5))+",width=1080,height="+str(random.randint(1400,1499))+"};FBLC/"+str(random.choice(["cs_CZ","en_GB","en_US","lt_LT","pl_PL","id_ID","ru_RU","pt_PT","he_IL","hi_IN","nl_NL"," it_IT","en_IN","es_ES","en_PK"]))+";FBRV/"+str(random.randint(111111111,999999999))+";FBCR/"+str(random.choice(["Tele2You","Telenor","FASTWEB","Banglalink","Sprint","Jazz","Vodafone IN","Vi India","Tele2 LT","Jio 4G","EE","Oi","MtelBG","AT&amp;amp-T","Ufone","Azercell"]))+";FBMF/Xiaomi;FBBD/"+str(random.choice(["xiaomi","Xiaomi","Redmi"]))+";FBPN/com.facebook.katana;FBDV/"+str(random.choice(["M2101K7AG","M2003J15SC","M2004J19C","M2006C3LG","M2007J20CG","M2010J19CG","M2011K2C","M2012K11AG","M2101K7BG","M2101K9G","M2102J20SG","M2102K1G","M2003J15SC","MI MAX 2","AT&amp;amp-T","Redmi Note 4", "Redmi 4X","Redmi Note 8 Pro","Redmi Note 5","Redmi Note 8T","Redmi 6A","Redmi 7A","MI PLAY","MI 8 Lite","Mi 9T","Mi A2 Lite"," Mi 9", "M2101K7AG"]))+";FBSV/"+str(random.randint(9,12))+";FBOP/1;FBCA/arm64-v8a:;]"

    return user_agents

android_user_agents = DARK_LMNx9()
for user_agent in android_user_agents:
    colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])    

    
#______________________________#        
#_________MAIN--LMNx9_________#
#______________________________#   

print('\n\nExample : 5_ 20_ 10')

limit = inpt('Enter Limit :')

#_______UA--2_________
if limit in ['2']:
    for _ in range(2):
        colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)
                
#_______UA--5_________
if limit in ['5','05']:
    for _ in range(5):
        colour = random.choice(['\033[1m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)

#_______UA--10_________
if limit in ['10']:
    for _ in range(10):
        colour = random.choice(['\033[91m'\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)
        
#_______UA--20_________
if limit in ['20']:
    for _ in rage(20)
        colour = random.coice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)

#_______UA--30_________
if limit in ['30']:
    for _ in range(30):
        colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)


#_______UA--40_________
if limit in ['40']:
    for _ in range(40):
        colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)
 
#_______UA--50_________
if limit in ['50']:
    for _ in range(50):
        colour = random.chice(['\033[91m'\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)
 
#_______UA--60_________
if limit in ['60']:
    for _ in range(60):
        colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)

#_______UA--70_________
if limit in ['70']:
    for _ in range(70):
        colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)

#_______UA--80_________
if limit in ['80']:
    for _ in range(80):
        colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)

#_______UA--90_________
if limit in ['90']:
    for _ in range(90):
        colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)

#_______UA--100_________
if limit in ['100']:
    for _ in range(100):
        colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
        print('\n'+'\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n'+'\n'+colour+user_agent)


#______LMNx9--Meme__________
#_______UA--Unlimited_________
if limit in ['z','Z']:
    colour = random.choice(['\033[91m','\033[92m','\033[93m','\033[94m','\033[95m','\033[96m'])
    print('\n\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n')
    print('\n\t'+colour+'\033[1;33mSala Tui Kon Level Er '+'Madarcud 🤣')
    print('\n\t'+colour+'[1]Boro Naki [2]Choto '+'Madarcud 🤣')
    ans = input('\n\t\033[1;32mAkhane Bole Jah 😂 [1/2] ? : ')
    if ans in ['1']:
        print('\n\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n')
        print('\n\t🤣 \033[1;36mএকটা থাপ্পড় দিয়া ছোট করে দিমু 🤣')
        time.sleep(3)
        exit()
        
    if ans in ['2']:
        print('\n\033[1;31m┃😈┃\033[47m\033[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \033[40m\033[00m\x1b[1;91m┃😈┃\n')
        print('\n\t🤣 \033[1;36mথাক তোরে কিছু কইলাম না 😀')
        time.sleep(3)
        exit()
           
